In [35]:
import pandas as pd
df1 = pd.DataFrame(data={'A':['a','d'],'b':['A','D']})
df2 = pd.DataFrame(data={'A':['b','c'],'B':['B','C']})
df3 = pd.concat([df1,df2],ignore_index=True).drop_duplicates(ignore_index=True)
df3

   A    b    B
0  a    A  NaN
1  d    D  NaN
2  b  NaN    B
3  c  NaN    C

In [2]:
df3.drop(3,inplace=True)

In [3]:
df3

   A    b    B
0  a    A  NaN
1  d    D  NaN
2  b  NaN    B

In [202]:
import numpy as np
# df3['c']=''
# df4 = df3.sample(n=2)
# df4

In [36]:
df3['B'][df3['b'].notnull()] = df3[df3['b'].notnull()]['b']
df3
df3 = df3.drop('b',axis = 1)
df3

   A  B
0  a  A
1  d  D
2  b  B
3  c  C

In [37]:
df3['C']= ''
df3.loc[(df3['A']=='d') |( df3['B'] == 'B'),'C'] = 1
df3

   A  B  C
0  a  A
1  d  D  1
2  b  B  1
3  c  C

In [38]:
df3[df3['C']=='']['C'] = 0
df3

<ipython-input-38-a8c85866bcb4>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3[df3['C']=='']['C'] = 0

   A  B  C
0  a  A
1  d  D  1
2  b  B  1
3  c  C

In [41]:
df3.loc[df3['C']=='','C'] = 0
df3

   A  B  C
0  a  A  0
1  d  D  1
2  b  B  1
3  c  C  0

In [58]:
(df3['A']=='a') & (df3['B']=='A')

0     True
1    False
2    False
3    False
dtype: bool

In [319]:
# df3.rename(columns={'B':'b'},inplace=True)
df3[['A','B']]

   A  B
0  a  A
1  d  D
2  b  B
3  c  C

In [303]:
df3['C']=''
for i in range(len(df3)):
    if df3['A'][i] == 'a' or df3['B'][i] == 'B':
        df3['C'][i]=1
    else:
        df3['C'][i]=0
#     df3['C'][i] = 0
df3

   A  B  C
0  a  A  1
1  d  D  0
2  b  B  1
3  c  C  0

In [250]:
a_dict = {'A':1,'B':2,'C':3,'D':4}
df3['C']=''
for i in range(len(df3)):
    df3['C'][i] = a_dict[df3['B'][i]]
df3

   A  B  C
0  a  A  1
1  d  D  4
2  b  B  2
3  c  C  3

In [252]:
df3.loc[df3['C']==1]

   A  B  C
0  a  A  1

In [266]:
df3['B']=='D'

pandas.core.series.Series

In [210]:
for i in range(len(df3)):
    df3['A'][i] = df3['A'][i].upper()
df3.drop(3)

   A    b  B c
0  A    A  A
1  D    D  D
2  B  NaN  B
3  C  NaN  C

In [211]:
df3.drop(3)

   A    b  B c
0  A    A  A
1  D    D  D
2  B  NaN  B

In [132]:
df3 = pd.concat([df3.loc[df3['B'].notnull()].drop('b',axis=1),df3.loc[df3['b'].notnull()].drop('B',axis=1).rename(columns={'b':'B'})]).sort_index()
df3

   A  B
0  a  A
0  a  A
1  d  D
1  d  D
2  b  B
3  c  C

In [337]:
from datetime import datetime
for i in range(len(df)):
    try:
        df['datestop'][i] = datetime.strptime(df['datestop'][i],'%Y/%m/%d')
    except:
        df['datestop'][i]
df

ValueError: time data ' ' does not match format '%Y/%m/%d'

In [405]:
df2 = pd.DataFrame()
pd.to_datetime('1262004', format='%m%d%Y',errors='coerce')
# df2
# df2['datestop']
# df2['datestop'].dtype

Timestamp('2004-12-06 00:00:00')

In [376]:
help(to_datetime)

NameError: name 'to_datetime' is not defined

In [392]:
df1 = pd.DataFrame(data={'A':[np.datetime64('2021-02-02'),np.datetime64('2021-02-03')]})
df1
df2 = pd.to_datetime(df1['A'])
df2

0   2021-02-02
1   2021-02-03
Name: A, dtype: datetime64[ns]